{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_4_1/kernel", "shape": [256, 393]}, {"dtype": "float32", "name": "dense_4_1/bias", "shape": [393]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "lstm_9_1/kernel", "shape": [393, 1024]}, {"dtype": "float32", "name": "lstm_9_1/recurrent_kernel", "shape": [256, 1024]}, {"dtype": "float32", "name": "lstm_9_1/bias", "shape": [1024]}]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "trainable": true, "recurrent_regularizer": null, "implementation": 1, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_constraint": null, "name": "lstm_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "use_bias": true, "batch_input_shape": [null, 10, 393], "activation": "tanh", "return_sequences": false, "bias_constraint": null, "kernel_regularizer": null, "units": 256, "recurrent_dropout": 0.0, "kernel_constraint": null, "stateful": false, "go_backwards": false}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_4", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 393, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}}]}, "keras_version": "2.1.5", "training_config": {"optimizer_config": {"class_name": "RMSprop", "config": {"decay": 0.0, "lr": 0.009999999776482582, "rho": 0.8999999761581421, "epsilon": 1e-07}}, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["acc"], "sample_weight_mode": null}}}